using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace RiskEvaluating_WinForms_
{
    internal class MPCs
    {
        public string[] Chemicals = new string[27];
        public float[] MPSc_instant = new float[27];
        public float[] MPSc_daily = new float[27];
        public float[] MPSc_year = new float[27];
        public int[] DangerClass = new int[27];

        public MPCs()
        {
            MPSc_instant[1] = 0.4f;  // Азота оксид II
            MPSc_instant[2] = 0.2f; // Азота диоксид
            MPSc_instant[3] = 0.03f; // Акролеин (акриловый альдегид)
            MPSc_instant[4] = 0.2f; // Амиак
            MPSc_instant[5] = 0.000001f; // Бензапирен
            MPSc_instant[6] = 0.5f; // Взвешенные вещества
            MPSc_instant[7] = 0.3f; // Взвешенные частицы РМ10
            MPSc_instant[8] = 0.16f; // Взвешенные частицы РМ2.5
            MPSc_instant[9] = 0.01f; // Гидроксибензол (фенол)
            MPSc_instant[10] = 0.005f; // Диалюминий триоксид
            MPSc_instant[11] = 0.04f; // Железа III оксид
            MPSc_instant[12] = 0.00002f; // Кадмий оксид (в перечсете на кадмий)
            MPSc_instant[13] = 0.01f; // Марганец и его соединения
            MPSc_instant[14] = 0.00002f; // Медь оксид (в пересчете на медь)
            MPSc_instant[15] = 1f; // Метанол
            MPSc_instant[16] = 0.00005f; // Никель и его соединения
            MPSc_instant[17] = 0.00003f; // Ртуть
            MPSc_instant[18] = 0.001f; // Свинец и его неорганические соединения
            MPSc_instant[19] = 0.5f; // Сера диоксид
            MPSc_instant[20] = 0.03f; // Сероуглерод
            MPSc_instant[21] = 5f; // Углерод оксид
            MPSc_instant[22] = 0.15f; // Углерод сажа
            MPSc_instant[23] = 0.05f; // Формальдегид
            MPSc_instant[24] = 0.0001f; // Хром
            MPSc_instant[25] = 0.035f; // Цинк оксид
            MPSc_instant[26] = 0.04f; // Этенилбензол, винилбензол (стирол)


            //==========================================================================


            MPSc_daily[1] = 0.06f;  // Азота оксид II
            MPSc_daily[2] = 0.1f; // Азота диоксид
            MPSc_daily[3] = 0.01f; // Акролеин (акриловый альдегид)
            MPSc_daily[4] = 0.1f; // Амиак
            MPSc_daily[5] = 0.000001f; // Бензапирен
            MPSc_daily[6] = 0.15f; // Взвешенные вещества
            MPSc_daily[7] = 0.06f; // Взвешенные частицы РМ10
            MPSc_daily[8] = 0.035f; // Взвешенные частицы РМ2.5
            MPSc_daily[9] = 0.006f; // Гидроксибензол (фенол)
            MPSc_daily[10] = 0.01f; // Диалюминий триоксид
            MPSc_daily[11] = 0.04f; // Железа III оксид
            MPSc_daily[12] = 0.0003f; // Кадмий оксид (в перечсете на кадмий)
            MPSc_daily[13] = 0.001f; // Марганец и его соединения
            MPSc_daily[14] = 0.002f; // Медь оксид (в пересчете на медь)
            MPSc_daily[15] = 0.5f; // Метанол
            MPSc_daily[16] = 0.001f; // Никель и его соединения
            MPSc_daily[17] = 0.0003f; // Ртуть
            MPSc_daily[18] = 0.0003f; // Свинец и его неорганические соединения
            MPSc_daily[19] = 0.05f; // Сера диоксид
            MPSc_daily[20] = 0.005f; // Сероуглерод
            MPSc_daily[21] = 3f; // Углерод оксид
            MPSc_daily[22] = 0.05f; // Углерод сажа
            MPSc_daily[23] = 0.01f; // Формальдегид
            MPSc_daily[24] = 0.0015f; // Хром
            MPSc_daily[25] = 0.05f; // Цинк оксид
            MPSc_daily[26] = 0.002f; // Этенилбензол, винилбензол (стирол)


            //==================================================================================


            MPSc_year[1] = 0.06f;  // Азота оксид II
            MPSc_year[2] = 0.04f; // Азота диоксид
            MPSc_year[3] = 0.001f; // Акролеин (акриловый альдегид)
            MPSc_year[4] = 0.04f; // Амиак
            MPSc_year[5] = 0.000001f; // Бензапирен
            MPSc_year[6] = 0.075f; // Взвешенные вещества
            MPSc_year[7] = 0.04f; // Взвешенные частицы РМ10
            MPSc_year[8] = 0.025f; // Взвешенные частицы РМ2.5
            MPSc_year[9] = 0.003f; // Гидроксибензол (фенол)
            MPSc_year[10] = 0.005f; // Диалюминий триоксид
            MPSc_year[11] = 0.04f; // Железа III оксид
            MPSc_year[12] = 0.00002f; // Кадмий оксид (в перечсете на кадмий)
            MPSc_year[13] = 0.00005f; // Марганец и его соединения
            MPSc_year[14] = 0.00002f; // Медь оксид (в пересчете на медь)
            MPSc_year[15] = 0.2f; // Метанол
            MPSc_year[16] = 0.00005f; // Никель и его соединения
            MPSc_year[17] = 0.00003f; // Ртуть
            MPSc_year[18] = 0.00015f; // Свинец и его неорганические соединения
            MPSc_year[19] = 0.05f; // Сера диоксид
            MPSc_year[20] = 0.005f; // Сероуглерод
            MPSc_year[21] = 3f; // Углерод оксид
            MPSc_year[22] = 0.025f; // Углерод сажа
            MPSc_year[23] = 0.003f; // Формальдегид
            MPSc_year[24] = 0.0001f; // Хром
            MPSc_year[25] = 0.035f; // Цинк оксид
            MPSc_year[26] = 0.002f; // Этенилбензол, винилбензол (стирол)


            //========================================================================================


            Chemicals[1] = "Азота оксид II";  // Азота оксид II
            Chemicals[2] = "Азота диоксид"; // Азота диоксид
            Chemicals[3] = "Акролеин (акриловый альдегид)"; // Акролеин (акриловый альдегид)
            Chemicals[4] = "Аммиак"; // Аммиак
            Chemicals[5] = "Бензапирен"; // Бензапирен
            Chemicals[6] = "Взвешенные вещества"; // Взвешенные вещества
            Chemicals[7] = "Взвешенные частицы РМ10"; // Взвешенные частицы РМ10
            Chemicals[8] = "Взвешенные частицы РМ2.5"; // Взвешенные частицы РМ2.5
            Chemicals[9] = "Гидроксибензол (фенол)"; // Гидроксибензол (фенол)
            Chemicals[10] = "Диалюминий триоксид"; // Диалюминий триоксид
            Chemicals[11] = "Железа III оксид"; // Железа III оксид
            Chemicals[12] = "Кадмий оксид (в перечсете на кадмий)"; // Кадмий оксид (в перечсете на кадмий)
            Chemicals[13] = "Марганец и его соединения"; // Марганец и его соединения
            Chemicals[14] = "Медь оксид (в пересчете на медь)"; // Медь оксид (в пересчете на медь)
            Chemicals[15] = "Метанол"; // Метанол
            Chemicals[16] = "Никель и его соединения"; // Никель и его соединения
            Chemicals[17] = "Ртуть"; // Ртуть
            Chemicals[18] = "Свинец и его неорганические соединения"; // Свинец и его неорганические соединения
            Chemicals[19] = "Сера диоксид"; // Сера диоксид
            Chemicals[20] = "Сероуглерод"; // Сероуглерод
            Chemicals[21] = "Углерод оксид"; // Углерод оксид
            Chemicals[22] = "Углерод/сажа"; // Углерод/сажа
            Chemicals[23] = "Формальдегид"; // Формальдегид
            Chemicals[24] = "Хром"; // Хром
            Chemicals[25] = "Цинк оксид"; // Цинк оксид
            Chemicals[26] = "Этенилбензол, винилбензол (стирол)"; // Этенилбензол, винилбензол (стирол)


            //========================================================================================


            DangerClass[1] = 3;  // Азота оксид II
            DangerClass[2] = 3; // Азота диоксид
            DangerClass[3] = 2; // Акролеин (акриловый альдегид)
            DangerClass[4] = 4;// Аммиак
            DangerClass[5] = 1; // Бензапирен
            DangerClass[6] = 3; // Взвешенные вещества
            DangerClass[7] = 4; // Взвешенные частицы РМ10   // ????????????????????????????????????????
            DangerClass[8] = 4; // Взвешенные частицы РМ2.5  // ????????????????????????????????????????
            DangerClass[9] = 2; // Гидроксибензол (фенол)
            DangerClass[10] = 2; // Диалюминий триоксид
            DangerClass[11] = 4; // Железа III оксид
            DangerClass[12] = 1; // Кадмий оксид (в перечсете на кадмий)
            DangerClass[13] = 2; // Марганец и его соединения
            DangerClass[14] = 2; // Медь оксид (в пересчете на медь)
            DangerClass[15] = 3; // Метанол
            DangerClass[16] = 2; // Никель и его соединения
            DangerClass[17] = 1; // Ртуть
            DangerClass[18] = 1; // Свинец и его неорганические соединения
            DangerClass[19] = 3; // Сера диоксид
            DangerClass[20] = 2; // Сероуглерод
            DangerClass[21] = 4; // Углерод оксид
            DangerClass[22] = 3; // Углерод/сажа
            DangerClass[23] = 2; // Формальдегид
            DangerClass[24] = 1; // Хром
            DangerClass[25] = 3; // Цинк оксид
            DangerClass[26] = 2; // Этенилбензол, винилбензол (стирол)
        }
    }
}
